<?
$h = date('G');
function getPartDay($h){
	if($h>=8 && $h<12) return 'Доброе утро';
	elseif($h>=12 && $h<18) return 'Добрый день';
	elseif($h>=18 && $h<22) return 'Добрый вечер';
	elseif(($h>=22 && $h<24)||($h>=0 && $h<8)) return 'Доброй ночи';
}
?>
<!DOCTYPE html>
<html lang="ru">
<head>
	<meta charset="UTF-8">
	<title>GIT</title>
	<style>
	div {
		width: 1000px;
		margin: auto;
		font-size: 25px;
	}
		nav a {
		text-decoration: none;
		color: #555;
		/*background: #eee;*/
		padding: 10px;
	}
	nav ul {
		padding: 0;
		display: flex;
		justify-content: space-around;
	}
	nav li {
		list-style: none;
	}
</style>
</head>
<body>
	<div>
		<nav>
			<ul>
				<li><a href="#">ссылка1</a></li>
				<li><a href="#">ссылка2</a></li>
				<li><a href="#">ссылка3</a></li>
				<li><a href="#">ссылка4</a></li>
				<li><a href="#">ссылка5</a></li>
			</ul>
		</nav>
		<h1>Сегодня <?=date('d.n.Y')?></h1>
		<h2>Время <?=date('G:i')?></h2>
		<h2><?=getPartDay(date('G'))?></h2>
		<h2><?=getPartDay(date('G'))?></h2>
		<p>Далеко-далеко за словесными горами в стране, гласных и согласных живут рыбные тексты. Напоивший обеспечивает путь, океана гор журчит он мир букв? Семантика живет, мир, дороге страну грамматики, ведущими агенство рекламных все рукопись послушавшись вскоре продолжил пунктуация, назад возвращайся текста если маленькая. Рыбного необходимыми, до рот взобравшись журчит маленькая, меня переулка инициал раз пояс точках коварных возвращайся снова злых семантика образ коварный щеке однажды языкового ручеек жизни проектах родного. Рукопись речью предупреждал, ее осталось семантика переписали взгляд мир запятой ipsum. Жизни большого, текстов, напоивший деревни раз пояс его там великий страна образ диких маленький своего что последний всеми они моей предложения рыбными строчка.</p>
		<p>Журчит подзаголовок переписывается пустился назад проектах, использовало взгляд наш коварных, силуэт повстречался рыбного инициал. Ее коварный рекламных маленькая маленький страну гор деревни, за домах вопрос реторический большого решила продолжил текстами безорфографичный проектах она грустный. Толку наш алфавит рыбного несколько маленький пор имени до, точках ведущими, проектах предупредила последний. Вопрос, толку буквоград семь составитель правилами силуэт над эта пунктуация использовало меня родного семантика живет диких образ повстречался, до свой на берегу букв. Реторический заманивший образ ведущими выйти буквенных строчка ему предупредила грустный он языкового? Моей, меня рот первую, это переписали, наш жизни использовало имени скатился заманивший всемогущая над взгляд коварных вскоре там!</p>
		<p>Переулка рыбными оксмокс строчка курсивных ручеек дал ему деревни скатился вскоре своих за назад страна всеми рыбного буквоград пояс, предложения заглавных домах на берегу подзаголовок сбить грустный. Пор которое предупредила рот скатился великий, от всех своих коварный заголовок речью образ мир? Пор лучше щеке подзаголовок за текст обеспечивает безорфографичный, курсивных, сих предупреждал всемогущая приставка своих, знаках однажды своих буквенных послушавшись, до силуэт. Он наш своих рыбного дорогу щеке большой родного которое на берегу пустился города собрал заманивший безопасную толку пояс, lorem, до текст выйти запятых сих эта своих текста напоивший дороге то жизни. Продолжил снова, свой сих ведущими ipsum текст журчит своих? Одна.</p>
		<p>Приставка снова, собрал буквенных одна что грустный курсивных бросил моей предупредила безопасную послушавшись которое проектах предупреждал дорогу до продолжил агенство взгляд, сих запятой семь то лучше. Свой, власти имени страну снова, единственное мир великий заглавных предложения по всей, строчка его. Которой взобравшись безорфографичный живет, бросил, образ оксмокс, он несколько щеке но, запятых они предупредила строчка! Дал по всей строчка переписывается сих, безорфографичный, продолжил он. Запятых моей все даль большого предупреждал меня языком! Страну щеке ее даже буквенных там над толку но имени первую текстов алфавит деревни, своих рот города диких раз букв. Всеми не алфавит он заглавных взгляд образ безорфографичный, журчит коварный.</p>
		<p>Возвращайся толку себя, строчка, жизни над текст. Дал первую, образ залетают своих предложения оксмокс текст она злых большой буквенных, то домах заглавных это маленькая, коварных лучше родного власти? Предупредила от всех оксмокс правилами вопроса однажды парадигматическая, диких, великий себя они семантика которой языком своих встретил текстов заглавных собрал не толку маленький пояс! Злых коварных вскоре, текстами что. Строчка рыбного заголовок снова толку алфавит но гор, своего если буквенных бросил, напоивший подзаголовок силуэт большого использовало свое ему грамматики повстречался, коварных необходимыми залетают рекламных, lorem. Они текстами свой, моей языком власти переписали текста ручеек домах бросил не, страну если составитель. Заголовок свое, речью.</p>
		<p>Агенство, вершину выйти он путь жаренные осталось раз. Рыбными большого продолжил вскоре запятой меня от всех рекламных, точках алфавит коварных свою сбить лучше, ведущими ее вершину снова. Бросил ему реторический, пустился щеке по всей взгляд великий своего до выйти, алфавит если, за большого повстречался рот. Обеспечивает ты безопасную lorem первую, сих дорогу, рыбного пояс имеет запятых пустился единственное его сбить инициал выйти прямо но свой лучше о? Переписали осталось, даже снова рыбного страну. Дороге буквенных агенство, путь моей семантика алфавит его даже. Города толку рыбными lorem оксмокс составитель над, то страну он раз. Наш он рот lorem, семантика, предупредила пояс приставка семь.</p>
		<p>Подзаголовок, решила правилами. Агенство возвращайся, гор заманивший большой. О текста, своих там курсивных рыбного взгляд lorem коварных семь, безорфографичный правилами скатился домах власти использовало! Осталось по всей продолжил составитель, lorem там дорогу силуэт собрал даль ведущими это. Дорогу, ручеек! Что большого сих силуэт буквенных ipsum то правилами своих всемогущая первую безорфографичный одна ручеек запятых предупредила страну имеет речью агенство страна, щеке за? Всеми вскоре осталось он речью что, запятой, жизни несколько дорогу одна толку, букв! Текст рекламных осталось свою которое ручеек. Ipsum дороге парадигматическая составитель последний которое, переписывается ты, маленький приставка, родного всемогущая речью подпоясал города большого собрал мир то заманивший.</p>
	</div>
<script>
//var liArr = document.getElementsByTagName('li');
//for(e in liArr){
	/*liArr[e].*///onmouseover = function(){this.style.background='red'};
	/*liArr[e].*///onmouseout = function(){this.style.background=''};
//}
//onmouseover = function(){console.log(this.document)};

var liArr = document.getElementsByTagName('*');
var item;
for(e in liArr){
	//if(liArr[e].tagName != 'DIV'&&liArr[e].tagName != 'HTML'&&liArr[e].tagName != 'body'&&liArr[e].tagName != 'BODY')
	{
		liArr[e].onmouseover = function(){
		this.style='background:rgba(230, 109, 109, 0.15);outline: 1px solid red;';
		item = this;
		
		}
		console.log(liArr[e].tagName);
		liArr[e].onmouseout = function(){this.style=''};
	}
}

</script>
</body>
</html>
